# Week 1 - Day 6 Quiz
# Column add & data processing

In [1]:
import pandas as pd

df = pd.read_csv("data.csv.txt")
df

      name  score
0    Alice     85
1      Bob     72
2  Charlie     90
3    David     60

In [2]:
df["result"] = df["score"] >= 85
df

      name  score  result
0    Alice     85    True
1      Bob     72   False
2  Charlie     90    True
3    David     60   False

In [4]:
df["grade"] = df["score"].apply(
    lambda x: "A" if x >= 85 else "B"
)
df

      name  score  result grade
0    Alice     85    True     A
1      Bob     72   False     B
2  Charlie     90    True     A
3    David     60   False     B

In [5]:
df_sorted = df.sort_values(by="score", ascending=True)
df_sorted

      name  score  result grade
3    David     60   False     B
1      Bob     72   False     B
0    Alice     85    True     A
2  Charlie     90    True     A